## Data Science in Python (C1 T2)

Overall goal: Design and implement a creative solution that will allow us to understand how much credit to allow someone to use or if someone should be approved or not approved. 

Goal 1: Define the problem within a data science framework and understand the differences between what we have been doing with DA and what we will be doing with this project. 

Subtask 1: Load data and clean the data extensively. 

Data Features: https://s3.amazonaws.com/gbstool/courses/910/docs/DataSourceUpdated5.18.pdf?X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Date=20201206T174838Z&X-Amz-SignedHeaders=host&X-Amz-Expires=36900&X-Amz-Credential=AKIAJBIZLMJQ2O6DKIAA%2F20201206%2Fus-east-1%2Fs3%2Faws4_request&X-Amz-Signature=b2b023cefd02e54efc05bf0fa4acb4b861af01d8342be33ad0b17715b75e43ea

This data step requires that I load the data by quering a database and then obtaining the Credit One Data. I'll use SQL to query the table and retrieve into a Pandas dataframe.

In [113]:
#Importing modules - Downloaded Mysql and then within the conda environment, applied both sqlalchemy and pymysql

from sqlalchemy import create_engine
import pymysql
import pandas as pd
import numpy as np

In [114]:
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'

In [115]:
db_connection = create_engine(db_connection_str)

In [116]:
df = pd.read_sql('SELECT * FROM credit', con=db_connection)

In [117]:
df.head

<bound method NDFrame.head of       MyUnknownColumn         X1      X2           X3        X4   X5     X6  \
0                  ID  LIMIT_BAL     SEX    EDUCATION  MARRIAGE  AGE  PAY_0
1                   1      20000  female   university         1   24      2
2                   2     120000  female   university         2   26     -1
3                   3      90000  female   university         2   34      0
4                   4      50000  female   university         1   37      0
...               ...        ...     ...          ...       ...  ...    ...
30199           29996     220000    male  high school         1   39      0
30200           29997     150000    male  high school         2   43     -1
30201           29998      30000    male   university         2   37      4
30202           29999      80000    male  high school         1   41      1
30203           30000      50000    male   university         1   46      0

          X7     X8     X9  ...        X15        X16        X17       X18  \
0      PAY_2  PAY_3  PAY_4  ...  BILL_AMT4  BILL_AMT5  BILL_AMT6  PAY_AMT1
1          2     -1     -1  ...          0          0          0         0
2          2      0      0  ...       3272       3455       3261         0
3          0      0      0  ...      14331      14948      15549      1518
4          0      0      0  ...      28314      28959      29547      2000
...      ...    ...    ...  ...        ...        ...        ...       ...
30199      0      0      0  ...      88004      31237      15980      8500
30200     -1     -1     -1  ...       8979       5190          0      1837
30201      3      2     -1  ...      20878      20582      19357         0
30202     -1      0      0  ...      52774      11855      48944     85900
30203      0      0      0  ...      36535      32428      15313      2078

            X19       X20       X21       X22       X23  \
0      PAY_AMT2  PAY_AMT3  PAY_AMT4  PAY_AMT5  PAY_AMT6
1           689         0         0         0         0
2          1000      1000      1000         0      2000
3          1500      1000      1000      1000      5000
4          2019      1200      1100      1069      1000
...         ...       ...       ...       ...       ...
30199     20000      5003      3047      5000      1000
30200      3526      8998       129         0         0
30201         0     22000      4200      2000      3100
30202      3409      1178      1926     52964      1804
30203      1800      1430      1000      1000      1000

                                Y
0      default payment next month
1                         default
2                         default
3                     not default
4                     not default
...                           ...
30199                 not default
30200                 not default
30201                     default
30202                     default
30203                     default

[30204 rows x 25 columns]>

In [118]:
#Since I am most familiar with using a CSV, I will convert it to a CSV using the following: 

df.to_csv('credit-one.csv',index=False)

In [119]:
#The following code deletes the unwanted header info from provided data
#Also stores it as a variable

data = pd.read_csv('credit-one.csv', skiprows=[0])

In [120]:
data.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
1,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

In [121]:
data.shape

(30203, 25)

In [122]:
data.describe()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
count,30202,30203,30203,30203,30203,30203,30203,30203,30203,30203,...,30203,30203,30203,30203,30203,30203,30203,30203,30203,30203
unique,30001,83,4,6,6,58,13,13,13,13,...,21550,21012,20606,7945,7901,7520,6939,6899,6941,4
top,27,50000,female,university,2,29,0,0,0,0,...,0,0,0,0,0,0,0,0,0,not default
freq,2,3397,18217,14107,16088,1619,14828,15830,15863,16566,...,3218,3530,4045,5287,5437,6007,6450,6744,7233,23519

In [123]:
#true if an entire row is identical to a previous row the one above it
data.duplicated ()

0        False
1        False
2        False
3        False
4        False
         ...
30198    False
30199    False
30200    False
30201    False
30202    False
Length: 30203, dtype: bool

In [124]:
data.duplicated ().sum ()

201

In [125]:
#Adding the parameters (Inplace=true) will allow me to drop the duplicates without needing to create a new variable
data.drop_duplicates(inplace=True)

In [126]:
#proof that the duplicates were dropped
data.describe

<bound method NDFrame.describe of           ID LIMIT_BAL     SEX    EDUCATION MARRIAGE AGE PAY_0 PAY_2 PAY_3  \
0          1     20000  female   university        1  24     2     2    -1
1          2    120000  female   university        2  26    -1     2     0
2          3     90000  female   university        2  34     0     0     0
3          4     50000  female   university        1  37     0     0     0
4          5     50000    male   university        1  57    -1     0    -1
...      ...       ...     ...          ...      ...  ..   ...   ...   ...
30198  29996    220000    male  high school        1  39     0     0     0
30199  29997    150000    male  high school        2  43    -1    -1    -1
30200  29998     30000    male   university        2  37     4     3     2
30201  29999     80000    male  high school        1  41     1    -1     0
30202  30000     50000    male   university        1  46     0     0     0

      PAY_4  ... BILL_AMT4 BILL_AMT5 BILL_AMT6 PAY_AMT1 PAY_AMT2 PAY_AMT3  \
0        -1  ...         0         0         0        0      689        0
1         0  ...      3272      3455      3261        0     1000     1000
2         0  ...     14331     14948     15549     1518     1500     1000
3         0  ...     28314     28959     29547     2000     2019     1200
4         0  ...     20940     19146     19131     2000    36681    10000
...     ...  ...       ...       ...       ...      ...      ...      ...
30198     0  ...     88004     31237     15980     8500    20000     5003
30199    -1  ...      8979      5190         0     1837     3526     8998
30200    -1  ...     20878     20582     19357        0        0    22000
30201     0  ...     52774     11855     48944    85900     3409     1178
30202     0  ...     36535     32428     15313     2078     1800     1430

      PAY_AMT4 PAY_AMT5 PAY_AMT6 default payment next month
0            0        0        0                    default
1         1000        0     2000                    default
2         1000     1000     5000                not default
3         1100     1069     1000                not default
4         9000      689      679                not default
...        ...      ...      ...                        ...
30198     3047     5000     1000                not default
30199      129        0        0                not default
30200     4200     2000     3100                    default
30201     1926    52964     1804                    default
30202     1000     1000     1000                    default

[30002 rows x 25 columns]>

In [127]:
data.shape

(30002, 25)

In [128]:
#Dropping NAN values and the parameters help avoid creating new variable for clean data
data.dropna(inplace=True)

In [129]:
data.shape

(30001, 25)

In [130]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30001 entries, 0 to 30202
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30001 non-null  object
 1   LIMIT_BAL                   30001 non-null  object
 2   SEX                         30001 non-null  object
 3   EDUCATION                   30001 non-null  object
 4   MARRIAGE                    30001 non-null  object
 5   AGE                         30001 non-null  object
 6   PAY_0                       30001 non-null  object
 7   PAY_2                       30001 non-null  object
 8   PAY_3                       30001 non-null  object
 9   PAY_4                       30001 non-null  object
 10  PAY_5                       30001 non-null  object
 11  PAY_6                       30001 non-null  object
 12  BILL_AMT1                   30001 non-null  object
 13  BILL_AMT2                   30001 non-null  object
 14  BILL_AMT3                   30001 non-null  object
 15  BILL_AMT4                   30001 non-null  object
 16  BILL_AMT5                   30001 non-null  object
 17  BILL_AMT6                   30001 non-null  object
 18  PAY_AMT1                    30001 non-null  object
 19  PAY_AMT2                    30001 non-null  object
 20  PAY_AMT3                    30001 non-null  object
 21  PAY_AMT4                    30001 non-null  object
 22  PAY_AMT5                    30001 non-null  object
 23  PAY_AMT6                    30001 non-null  object
 24  default payment next month  30001 non-null  object
dtypes: object(25)
memory usage: 6.0+ MB

In [131]:
data.dtypes

ID                            object
LIMIT_BAL                     object
SEX                           object
EDUCATION                     object
MARRIAGE                      object
AGE                           object
PAY_0                         object
PAY_2                         object
PAY_3                         object
PAY_4                         object
PAY_5                         object
PAY_6                         object
BILL_AMT1                     object
BILL_AMT2                     object
BILL_AMT3                     object
BILL_AMT4                     object
BILL_AMT5                     object
BILL_AMT6                     object
PAY_AMT1                      object
PAY_AMT2                      object
PAY_AMT3                      object
PAY_AMT4                      object
PAY_AMT5                      object
PAY_AMT6                      object
default payment next month    object
dtype: object

## Searching column by column for duplicate or dirty data
I looked through each column below, searched through each data type to ensure it was all uniform. If I was able to identify outliers, I dropped the row (while using the inplace=True parameters and always confirmed the code did what it was intended to do.

In [132]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['LIMIT_BAL'].value_counts()

50000        3365
20000        1976
30000        1610
80000        1567
200000       1528
             ...
327680          1
760000          1
1000000         1
LIMIT_BAL       1
690000          1
Name: LIMIT_BAL, Length: 82, dtype: int64

In [133]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['EDUCATION'].value_counts()

university         14030
graduate school    10585
high school         4917
other                468
EDUCATION              1
Name: EDUCATION, dtype: int64

In [134]:
#The following code will provide me with the exact row for which the double header is providing.
data[data["EDUCATION"]== "EDUCATION"]

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
202,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month

In [135]:
#The following code will allow me to drop row 202
data.drop([202], inplace= True )

In [136]:
#Confirm the drop
data[data["EDUCATION"]=="EDUCATION"]

Empty DataFrame
Columns: [ID, LIMIT_BAL, SEX, EDUCATION, MARRIAGE, AGE, PAY_0, PAY_2, PAY_3, PAY_4, PAY_5, PAY_6, BILL_AMT1, BILL_AMT2, BILL_AMT3, BILL_AMT4, BILL_AMT5, BILL_AMT6, PAY_AMT1, PAY_AMT2, PAY_AMT3, PAY_AMT4, PAY_AMT5, PAY_AMT6, default payment next month]
Index: []

[0 rows x 25 columns]

In [153]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 0 to 30202
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  object
 1   LIMIT_BAL                   30000 non-null  object
 2   SEX                         30000 non-null  object
 3   EDUCATION                   30000 non-null  object
 4   MARRIAGE                    30000 non-null  object
 5   AGE                         30000 non-null  object
 6   PAY_0                       30000 non-null  object
 7   PAY_2                       30000 non-null  object
 8   PAY_3                       30000 non-null  object
 9   PAY_4                       30000 non-null  object
 10  PAY_5                       30000 non-null  object
 11  PAY_6                       30000 non-null  object
 12  BILL_AMT1                   30000 non-null  object
 13  BILL_AMT2                   30000 non-null  object
 14  BILL_AMT3                   30000 non-null  object
 15  BILL_AMT4                   30000 non-null  object
 16  BILL_AMT5                   30000 non-null  object
 17  BILL_AMT6                   30000 non-null  object
 18  PAY_AMT1                    30000 non-null  object
 19  PAY_AMT2                    30000 non-null  object
 20  PAY_AMT3                    30000 non-null  object
 21  PAY_AMT4                    30000 non-null  object
 22  PAY_AMT5                    30000 non-null  object
 23  PAY_AMT6                    30000 non-null  object
 24  default payment next month  30000 non-null  object
dtypes: object(25)
memory usage: 6.0+ MB

In [138]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['SEX'].value_counts()

female    18112
male      11888
Name: SEX, dtype: int64

In [139]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['MARRIAGE'].value_counts()

2    15964
1    13659
3      323
0       54
Name: MARRIAGE, dtype: int64

In [140]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['AGE'].value_counts()

29    1605
27    1477
28    1409
30    1395
26    1256
31    1217
25    1186
34    1162
32    1158
33    1146
24    1127
35    1113
36    1108
37    1041
39     954
38     944
23     931
40     870
41     824
42     794
44     700
43     670
45     617
46     570
22     560
47     501
48     466
49     452
50     411
51     340
53     325
52     304
54     247
55     209
56     178
57     122
58     122
59      83
60      67
21      67
61      56
62      44
63      31
64      31
66      25
65      24
67      16
69      15
70      10
68       5
73       4
72       3
75       3
71       3
74       1
79       1
Name: AGE, dtype: int64

In [141]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['PAY_0'].value_counts()

0     14737
-1     5686
1      3688
-2     2759
2      2667
3       322
4        76
5        26
8        19
6        11
7         9
Name: PAY_0, dtype: int64

In [142]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['PAY_2'].value_counts()

0     15730
-1     6050
2      3927
-2     3782
3       326
4        99
1        28
5        25
7        20
6        12
8         1
Name: PAY_2, dtype: int64

In [143]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['PAY_3'].value_counts()

0     15764
-1     5938
-2     4085
2      3819
3       240
4        76
7        27
6        23
5        21
1         4
8         3
Name: PAY_3, dtype: int64

In [144]:
#Review the data count for each column.

0     16455
-1     5687
-2     4348
2      3159
3       180
4        69
7        58
5        35
6         5
1         2
8         2
Name: PAY_4, dtype: int64

In [145]:
#Review the data count for each column. 
data['PAY_5'].value_counts()

0     16947
-1     5539
-2     4546
2      2626
3       178
4        84
7        58
5        17
6         4
8         1
Name: PAY_5, dtype: int64

In [146]:
#Review the data count for each column. 
data['PAY_6'].value_counts()

0     16286
-1     5740
-2     4895
2      2766
3       184
4        49
7        46
6        19
5        13
8         2
Name: PAY_6, dtype: int64

In [147]:
#Review the data count for each column. 
data['BILL_AMT1'].value_counts()

0        2008
390       244
780        76
326        72
316        63
         ...
49099       1
20984       1
10890       1
16439       1
50927       1
Name: BILL_AMT1, Length: 22723, dtype: int64

In [148]:
#Review the data count for each column. 
data['BILL_AMT2'].value_counts()

0         2506
390        231
780         75
326         75
316         72
          ...
50195        1
154669       1
16818        1
75276        1
100184       1
Name: BILL_AMT2, Length: 22346, dtype: int64

In [149]:
#Review the data count for each column. 
data['BILL_AMT3'].value_counts()

0        2870
390       275
780        74
326        63
316        62
         ...
82852       1
82329       1
67673       1
13217       1
47318       1
Name: BILL_AMT3, Length: 22026, dtype: int64

In [150]:
#Review the data count for each column. This will give me a clear understanding of what info I should be looking for
data['BILL_AMT4'].value_counts()

0        3195
390       246
780       101
316        68
326        62
         ...
44593       1
54763       1
588         1
46434       1
14750       1
Name: BILL_AMT4, Length: 21548, dtype: int64

In [151]:
#Review the data count for each column. I keep noticing that all of the dtypes that come up are int64 
#I believe I have cleaned up the data enough so I can now convert to int with the next code
data['BILL_AMT5'].value_counts()

0        3506
390       235
780        94
316        79
326        62
         ...
8297        1
28585       1
45709       1
14081       1
50927       1
Name: BILL_AMT5, Length: 21010, dtype: int64

In [170]:
#Converted dtypes into integers (with the exception of sex and education) with the following code
data['ID'] = data['ID'].astype('int')
data['LIMIT_BAL'] = data['LIMIT_BAL'].astype('int')
data['MARRIAGE'] = data['MARRIAGE'].astype('int')
data['AGE'] = data['AGE'].astype('int')
data['PAY_0'] = data['PAY_0'].astype('int')
data['PAY_2'] = data['PAY_2'].astype('int')
data['PAY_3'] = data['PAY_3'].astype('int')
data['PAY_4'] = data['PAY_4'].astype('int')
data['PAY_5'] = data['PAY_5'].astype('int')
data['PAY_6'] = data['PAY_6'].astype('int')
data['BILL_AMT1'] = data['BILL_AMT1'].astype('int')
data['BILL_AMT2'] = data['BILL_AMT2'].astype('int')
data['BILL_AMT3'] = data['BILL_AMT3'].astype('int')
data['BILL_AMT4'] = data['BILL_AMT4'].astype('int')
data['BILL_AMT5'] = data['BILL_AMT5'].astype('int')
data['BILL_AMT6'] = data['BILL_AMT6'].astype('int')
data['PAY_AMT1'] = data['PAY_AMT1'].astype('int')
data['PAY_AMT2'] = data['PAY_AMT2'].astype('int')
data['PAY_AMT3'] = data['PAY_AMT3'].astype('int')
data['PAY_AMT4'] = data['PAY_AMT4'].astype('int')
data['PAY_AMT5'] = data['PAY_AMT5'].astype('int')
data['PAY_AMT6'] = data['PAY_AMT6'].astype('int')
data.dtypes

ID                             int64
LIMIT_BAL                      int64
SEX                           object
EDUCATION                     object
MARRIAGE                       int64
AGE                            int64
PAY_0                          int64
PAY_2                          int64
PAY_3                          int64
PAY_4                          int64
PAY_5                          int64
PAY_6                          int64
BILL_AMT1                      int64
BILL_AMT2                      int64
BILL_AMT3                      int64
BILL_AMT4                      int64
BILL_AMT5                      int64
BILL_AMT6                      int64
PAY_AMT1                       int64
PAY_AMT2                       int64
PAY_AMT3                       int64
PAY_AMT4                       int64
PAY_AMT5                       int64
PAY_AMT6                       int64
default payment next month    object
dtype: object

In [171]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30000 entries, 0 to 30202
Data columns (total 25 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   ID                          30000 non-null  int64
 1   LIMIT_BAL                   30000 non-null  int64
 2   SEX                         30000 non-null  object
 3   EDUCATION                   30000 non-null  object
 4   MARRIAGE                    30000 non-null  int64
 5   AGE                         30000 non-null  int64
 6   PAY_0                       30000 non-null  int64
 7   PAY_2                       30000 non-null  int64
 8   PAY_3                       30000 non-null  int64
 9   PAY_4                       30000 non-null  int64
 10  PAY_5                       30000 non-null  int64
 11  PAY_6                       30000 non-null  int64
 12  BILL_AMT1                   30000 non-null  int64
 13  BILL_AMT2                   30000 non-null  int64
 14  BILL_AMT3                   30000 non-null  int64
 15  BILL_AMT4                   30000 non-null  int64
 16  BILL_AMT5                   30000 non-null  int64
 17  BILL_AMT6                   30000 non-null  int64
 18  PAY_AMT1                    30000 non-null  int64
 19  PAY_AMT2                    30000 non-null  int64
 20  PAY_AMT3                    30000 non-null  int64
 21  PAY_AMT4                    30000 non-null  int64
 22  PAY_AMT5                    30000 non-null  int64
 23  PAY_AMT6                    30000 non-null  int64
 24  default payment next month  30000 non-null  object
dtypes: int64(22), object(3)
memory usage: 6.0+ MB

In [173]:
data.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
1,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
2,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
3,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default
4,5,50000,male,university,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,not default

In [175]:
data.describe()

,ID,LIMIT_BAL,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,PAY_6,...,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000,...,3.000000e+04,30000.000000,30000.000000,30000.000000,30000.000000,3.000000e+04,30000.00000,30000.000000,30000.000000,30000.000000
mean,15000.500000,167484.322667,1.551867,35.485500,-0.016700,-0.133767,-0.166200,-0.220667,-0.266200,-0.291100,...,4.701315e+04,43262.948967,40311.400967,38871.760400,5663.580500,5.921163e+03,5225.68150,4826.076867,4799.387633,5215.502567
std,8660.398374,129747.661567,0.521970,9.217904,1.123802,1.197186,1.196868,1.169139,1.133187,1.149988,...,6.934939e+04,64332.856134,60797.155770,59554.107537,16563.280354,2.304087e+04,17606.96147,15666.159744,15278.305679,17777.465775
min,1.000000,10000.000000,0.000000,21.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,-2.000000,...,-1.572640e+05,-170000.000000,-81334.000000,-339603.000000,0.000000,0.000000e+00,0.00000,0.000000,0.000000,0.000000
25%,7500.750000,50000.000000,1.000000,28.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,-1.000000,...,2.666250e+03,2326.750000,1763.000000,1256.000000,1000.000000,8.330000e+02,390.00000,296.000000,252.500000,117.750000
50%,15000.500000,140000.000000,2.000000,34.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,2.008850e+04,19052.000000,18104.500000,17071.000000,2100.000000,2.009000e+03,1800.00000,1500.000000,1500.000000,1500.000000
75%,22500.250000,240000.000000,2.000000,41.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,6.016475e+04,54506.000000,50190.500000,49198.250000,5006.000000,5.000000e+03,4505.00000,4013.250000,4031.500000,4000.000000
max,30000.000000,1000000.000000,3.000000,79.000000,8.000000,8.000000,8.000000,8.000000,8.000000,8.000000,...,1.664089e+06,891586.000000,927171.000000,961664.000000,873552.000000,1.684259e+06,896040.00000,621000.000000,426529.000000,528666.000000